{
  "main_characters": [
    {
      "id": 1,
      "name_eng": "Lucretia",
      "name_eus": "Lucretia",
      "description_eng": "Abandoned at five in hostile lands, Lucretia mastered survival. A rejuvenating elixir warped her mind, honing her deception and unseen nighttime plundering.",
      "description_eus": "Bost urterekin lurralde gogorretan abandonatua, Lucretiak biziraupena menperatu zuen. Elixir gaztetzaile batek bere burua aldarazi zuen, iruzurra eta gaueko lapurreta ikusezina zorrozten.",
      "special_skill_eng": "Turns enemy minions into melee-only deer. A potion card appears in the enemy's event area (2-round prep) to undo the effect but poisons them for 2 rounds. If the area is full, it replaces a random card.",
      "special_skill_eus": "Etsaiaren morroiak orein bihurtzen ditu, hurbileko erasora mugatuta. Eragina kentzeko, baina pozoia emanez, etsaiaren eremuan edabe bat agertzen da. Beteta badago, karta bat ordezkatzen du.",
      "image_src": "../images/main_characters/lucretia.png"
    },
    {
      "id": 2,
      "name_eng": "Angelo Di Mortis",
      "name_eus": "Angelo Di Mortis",
      "description_eng": "Angelo, a wealthy young man, burned his mansion and reveled in the chaos. After prison, he created Ethazium, a lethal potion that lured Kaotika’s darkest beings.",
      "description_eus": "Angelo, gazte aberatsa, bere jauregia erre eta kaosaz gozatu zuen. Kartzelatik irtenda, Ethazium sortu zuen, Kaotikako izaki ilunenak erakartzen zituen edabe hilgarria.",
      "special_skill_eng": "The inn's light shatters at turn's end, darkening the board. Angelo's lamp lets the user see through a circle around the mouse, while the enemy sees only card outlines.",
      "special_skill_eus": "Aterpeko argia apurtzen da, taula ilunduz. Angeloren lanparak erabiltzaileari zirkulu baten bidez ikusteko aukera ematen dio, etsaiak kartetako ertzak bakarrik ikusten ditu.",
      "image_src": "../images/main_characters/angelo.png"
    },
    {
      "id": 3,
      "name_eng": "The Erudite XG",
      "name_eus": "XG Eruditua",
      "description_eng": "XG, son of goldsmith magicians, struggles with anger. His Arcane Glasses control mental chaos at the cost of extreme hydration. He must master his impulses to be a worthy heir.",
      "description_eus": "XG, urregile magoen semea da, haserre arazoak dituena. Betaurreko arkanoak kaos mentala kontrolatzen dute eta aldi beran gehiegizko hidratazioa ematen dute. Impulsoak menperatu behar ditu oinordeko duin bat izateko.",
      "special_skill_eng": "XG loses his glasses, causing him to become furious. As a result, his minions receive a super boost of x1.75 on their “Madness” and “Strength” attributes.",
      "special_skill_eus": "XG-k betaurrekoak galtzen ditu eta amorratzen da. Ondorioz, bere minion-ek sekulako hobekuntza (x1.75) jasotzen dute bere “Erotasuna” eta “Indarra” atributuetan.",
      "image_src": "../images/main_characters/xg.png"
    },
    {
      "id": 4,
      "name_eng": "The Decrepit Throne",
      "name_eus": "Tronu Zaharra",
      "description_eng": "The Decrepit Throne, forged in the First Era, symbolized nobility. Its last heir, Joseph, obsessed by goblins, fused with the throne, trapped in eternal torment.",
      "description_eus": "Tronu Zaharra, Lehen Aroan forjatua izan zen, nobleziaren ikurra izanda. Honen azken oinordekoa, Joseph, goblinengatik obsesionatuta dagoena, tronuarekin fusionatu zen, betiko torturan arrapatuz.",
      "special_skill_eng": "The throne attracts the foe minions to the front combat area, as if it were a curse, and nullifies any type of action of the enemy during their next turn.",
      "special_skill_eus": "Tronuak aurreko borroka-eremura erakartzen ditu etsaiaren minion-ak, madarikazio bat balitz bezala, eta etsaiaren edozein ekintza bertan behera uzten du hurrengo txandan.",
      "image_src": "../images/main_characters/the_decrepit_throne.png"
    },
    {
      "id": 5,
      "name_eng": "Joseph",
      "name_eus": "Joseph",
      "description_eng": "Joseph, the last heir of the decrepit throne, became one with his rotting chair, lost in madness. Each night, he raves about goblins destroying it, blind to his own decaying fate.",
      "description_eus": "Joseph, tronu zaharkituaren azken oinordekoa, bat bihurtu zen bere aulki ustelarekin, eromenean galduta. Gauero, bera suntsitzen duten iratxoen gainean egiten du eldarnioa, bere patu dekadenteari itsututa.",
      "special_skill_eng": null,
      "special_skill_eus": null,
      "image_src": "../images/main_characters/joseph.png"
    }
  ],
  "joseph_chaotic_events": [
    {
      "id": 1,
      "name_eng": "Lightning Storm",
      "name_eus": "Tximista-Ekaitza",
      "description_eng": "Each turn, lightning bolts strike all the minions located in the movement grid, inflicting different quantities of damage (ranging from 5 to 35 hit points) on each of them, which are determined making use of the Math.random() static method.",
      "description_eus": "Txanda bakoitzean, tximistek mugimendu-lauki-sarean dauden mendeko guztiak jotzen dituzte, eta Math.random() metodo estatikoa erabiliz, kalte kantitate desberdinak eragiten dizkiete (5 eta 35 kolpe-puntu artekoak).",
      "main_character_id": 5
    },
    {
      "id": 2,
      "name_eng": "Sandstorm",
      "name_eus": "Harea-Ekaitza",
      "description_eng": "All minions randomly change positions at the end of each turn.",
      "description_eus": "Mendeko guztiek ausaz aldatzen dute posizioa txanda bakoitzaren amaieran.",
      "main_character_id": 5
    },
    {
      "id": 3,
      "name_eng": "Minion Rebellion",
      "name_eus": "Mendekoen Matxinada",
      "description_eng": "Some minions switch control and attack their own team. It considerably increases the probability of a botch, in this case the botch will not only affect the attacking minion but its allies as well.",
      "description_eus": "Mendeko batzuek kontrola aldatzen dute eta euren taldeari eraso egiten diote. Trakets bat izateko probabilitatea nabarmen handitzen du, kasu honetan akatsak erasotzaileari ez ezik bere aliatuei ere eragingo die.",
      "main_character_id": 5
    },
    {
      "id": 4,
      "name_eng": "Constant Swap",
      "name_eus": "Etengabeko Trukea",
      "description_eng": "After finishing each round, all minions located in the combat arena are exchanged between players.",
      "description_eus": "Txanda bakoitza amaitu ondoren, borroka-esparruan kokatutako mendeko guztiak trukatzen dira jokalarien artean.",
      "main_character_id": 5
    }
  ],
  "minions": [
    {
      "id": 1,
      "category_id": 1,
      "name_eng": "Deer",
      "name_eus": "Oreina",
      "description_eng": "A nature being, eager to knock down foes, fights with harmful but unthreatening hooves.",
      "description_eus": "Izaki natural bat da, etsaien kontra joateko gogo handia duena. Kaltetutako baina ez hain mehatxuta daukan apatxa erabiliz borrokatzen du.",
      "hp": 10,
      "madness": 10,
      "strength": 10,
      "attack": 10,
      "constitution": 10,
      "defense": 5,
      "image_src": "../images/minions/special/deer.jpeg"
    },
    {
      "id": 2,
      "category_id": 2,
      "name_eng": "Dredgar Ironfist",
      "name_eus": "Dredgar Burdin-Ukabila",
      "description_eng": "Dredgar, undefeated warrior from the frozen lands, shatters armor with his steel-gauntleted fist and once defeated an entire army alone.",
      "description_eus": "Dredgar, izen handiko gudaria, sekula porrotik jasan ez duena, bere burdin eskumuturrekoarekin armadurak apurtzen ditu eta armada bat bera bakarrik egonda garaitu zuen.",
      "hp": 90,
      "madness": 15,
      "strength": 40,
      "attack": 28,
      "constitution": 45,
      "defense": 38,
      "image_src": "../images/minions/warriors/warrior.png"
    },
    {
      "id": 3,
      "category_id": 2,
      "name_eng": "Thalrik the Unbroken",
      "name_eus": "Thalrik Hautsezina",
      "description_eng": "Once a gladiator, now a legend, Thalrik has survived countless battles and risen every time he was knocked down. He fights not for gold but for the thrill of battle.",
      "description_eus": "Garai batean gladiatore, orain mito, Thalrik zenbatezin borrokatatik bizirik atera da, eta eraitsi zuten bakoitzean gora egin du. Ez du urreagatik borrokatzen, baizik eta batailaren zirraragatik.",
      "hp": 80,
      "madness": 25,
      "strength": 50,
      "attack": 38,
      "constitution": 35,
      "defense": 23,
      "image_src": "../images/minions/warriors/warrior.png"
    },
    {
      "id": 4,
      "category_id": 2,
      "name_eng": "Vorrak Bloodfang",
      "name_eus": "Vorrak Odol-Letagina",
      "description_eng": "A half-orc warrior who fights like a wild beast and charges into battle without fear. When he is angry, nothing can stop him.",
      "description_eus": "Erdi orko gerlaria, basapizti bezala borrokatzen dena eta beldurrik gabe erasotzen duena. Haserretzen denean, ezerk ezin du geldiarazi.",
      "hp": 80,
      "madness": 30,
      "strength": 40,
      "attack": 35,
      "constitution": 40,
      "defense": 25,
      "image_src": "../images/minions/warriors/warrior.png"
    },
    {
      "id": 5,
      "category_id": 2,
      "name_eng": "Draska the Crimson",
      "name_eus": "Draska Gorrimina",
      "description_eng": "A warrior known for her speed and agility, Draska moves like the wind, never staying in one place for long. She fights with precision, always staying one step ahead of her enemies.",
      "description_eus": "Bere abiadura eta arintasunagatik ezaguna den gerlaria, Draska haizea bezala mugitzen da, inoiz leku batean denbora luzez egon gabe. Zehaztasun osoz borrokatzen du, beti bere etsaien aurrean urrats bat aurrerago geratuz.",
      "hp": 75,
      "madness": 10,
      "strength": 30,
      "attack": 20,
      "constitution": 25,
      "defense": 20,
      "image_src": "../images/minions/warriors/warrior.png"
    },
    {
      "id": 6,
      "category_id": 2,
      "name_eng": "Varrek",
      "name_eus": "Varrek",
      "description_eng": "A feared pirate warlord, Varrek commands both respect and terror. He is as ruthless as the sea, never staying in one place for too long, always seeking his next conquest.",
      "description_eus": "Gerrako jaun pirata beldurgarria, Varrek errespetua eta beldurra iradokitzen ditu. Itsasoa bezain gupidagabea da, inoiz leku batean denbora gehiegi egon gabe, beti bere hurrengo konkistaren bila.",
      "hp": 80,
      "madness": 40,
      "strength": 40,
      "attack": 40,
      "constitution": 30,
      "defense": 10,
      "image_src": "../images/minions/warriors/warrior.png"
    },
    {
      "id": 7,
      "category_id": 3,
      "name_eng": "Vaelora Moonshade",
      "name_eus": "Vaelora Ilargi-Itzala",
      "description_eng": "A mysterious sorceress who draws power from the stars. She can see the future and speaks in whispers that echo through the minds of those around her.",
      "description_eus": "Izarretatik boterea ateratzen duen azti misteriotsua. Etorkizuna ikus dezake, eta ingurukoen buruetan durundi egiten duten xuxurletan hitz egiten du.",
      "hp": 75,
      "madness": 10,
      "strength": 35,
      "attack": 23,
      "constitution": 20,
      "defense": 15,
      "image_src": "../images/minions/wizards/wizard.png"
    },
    {
      "id": 8,
      "category_id": 3,
      "name_eng": "Morgathis the Doomseer",
      "name_eus": "Morgathis Zoritxar-Igarlea",
      "description_eng": "Once a wise scholar, Morgathis had a vision of the end of the world. Now, he wants to bring that future to life. His magic rots and destroys everything it touches.",
      "description_eus": "Garai batean eruditu jakintsua, Morgathis-ek munduaren amaieraren ikuskaria izan zuen. Orain, etorkizun hori piztu egin nahi du. Bere magiak ukitzen duen guztia usteltzen eta suntsitzen du.",
      "hp": 70,
      "madness": 15,
      "strength": 30,
      "attack": 23,
      "constitution": 20,
      "defense": 13,
      "image_src": "../images/minions/wizards/wizard.png"
    },
    {
      "id": 9,
      "category_id": 3,
      "name_eng": "Eryndra the Frostborn",
      "name_eus": "Eryndra Izozteetatik Jaioa",
      "description_eng": "A sorceress who was born in an eternal winter. She wields the power of ice and snow, freezing entire battlefields and summoning blizzards with a whisper.",
      "description_eus": "Negu eternalean jaio zen sorgina. Izotzaren eta elurraren boterea erabiltzen du, xuxurla batekin gudu-zelai osoak izoztuz eta bisutsak sortuz.",
      "hp": 80,
      "madness": 15,
      "strength": 35,
      "attack": 25,
      "constitution": 25,
      "defense": 18,
      "image_src": "../images/minions/wizards/wizard.png"
    },
    {
      "id": 10,
      "category_id": 3,
      "name_eng": "Kaedor the Emberborn",
      "name_eus": "Kaedor Txingarretatik Jaioa",
      "description_eng": "A fire mage whose heart burns as fiercely as the flames he wields, Kaedor does not simply control fire, he is fire. His passion and energy make him a force of nature, both inspiring and terrifying.",
      "description_eus": "Kaedor suzko aztia da, eta erabiltzen dituen garrak bezain sutsu dauka bihotza. Sua kontrolatzeaz gain, sua ere bada. Bere grinak eta energiak naturaren indar bat bihurtzen dute, inspiratzailea bezain beldurgarria.",
      "hp": 80,
      "madness": 30,
      "strength": 45,
      "attack": 38,
      "constitution": 30,
      "defense": 15,
      "image_src": "../images/minions/wizards/wizard.png"
    },
    {
      "id": 11,
      "category_id": 3,
      "name_eng": "Nareth the Hollow",
      "name_eus": "Nareth Barnehutsa",
      "description_eng": "A mage who sacrificed his emotions for ultimate knowledge, Nareth is more of a shadow than a man. He feels no joy, no pain, only the endless pursuit of understanding. His presence unnerves even the bravest souls.",
      "description_eus": "Bere emozioak behin betiko ezagutzagatik sakrifikatu zituen mago bat, Nareth itzal bat da gizon bat baino gehiago. Ez du ez alaitasunik ez minik sentitzen, ulermenaren etengabeko bilaketa besterik ez. Haren presentziak arimarik ausartenak ere kezkatzen ditu.",
      "hp": 75,
      "madness": 10,
      "strength": 25,
      "attack": 18,
      "constitution": 15,
      "defense": 10,
      "image_src": "../images/minions/wizards/wizard.png"
    }
  ],
  "minion_categories": [
    {
      "id": 1,
      "name_eng": "Special",
      "name_eus": "Berezia"
    },
    {
      "id": 2,
      "name_eng": "Warrior",
      "name_eus": "Gerlaria"
    },
    {
      "id": 3,
      "name_eng": "Wizard",
      "name_eus": "Magoa"
    }
  ],
  "armor": [
    {
      "id": 1,
      "name_eus": "Koloso Primordialaren Bular-Plaka",
      "name_eng": "Breastplate of the Primordial Colossus",
      "description_eus": "Bular-plaka hau izar erori baten nukleoan sortu zen. Haren gogortasuna hain da handia, eraso boteretsuena jasateko gai dela, pitzadura bakar bat ere erakutsi gabe.",
      "description_eng": "This breastplate was forged in the core of a fallen star. Its hardness is such that it can withstand the most brutal attacks without even showing a crack.",
      "type_id": 3,
      "special_effect_eus": "Etsai batek erasotzen badu, kaltea bueltan jasoko du.",
      "special_effect_eng": "If an enemy attacks, the damage is reflected back onto them.",
      "durability": 50,
      "prep_time_in_rounds": 3,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 2,
      "name_eus": "Itzal Betierekoaren Mantua",
      "name_eng": "Cloak of Eternal Shadow",
      "description_eus": "Mantua honek jabea itzalen artean mugitzen uzten dio, erasoak erraz saihestuz. Gerlari arinena soilik erabili dezake.",
      "description_eng": "This cloak allows its user to move through shadows, evading attacks with ease. Only the most agile warriors can use it in combat.",
      "type_id": 1,
      "special_effect_eus": "Erabiltzaileak soilik behin urbilezko eraso bat saihesteko aukera dauka.",
      "special_effect_eng": "Once, allows the user to dodge a melee attack.",
      "durability": 10,
      "prep_time_in_rounds": 1,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 3,
      "name_eus": "Amorru Titanikoaren Armadura",
      "name_eng": "Armor of Titanic Fury",
      "description_eus": "Jasotzen duen kolpe bakoitzak honen erabiltzaileri indartzen du, borrokan bere erresistentzia eta haserrea handituz.",
      "description_eng": "Each received blow strengthens the user, increasing their endurance and rage in battle.",
      "type_id": 3,
      "special_effect_eus": "Erasoa jasotzen duen bakoitzean, erabiltzailearen hurrengo erasoak +10 kalte jasoko du.",
      "special_effect_eng": "Every time the wearer takes an attack, their next attack gains +10 damage.",
      "durability": 30,
      "prep_time_in_rounds": 2,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 4,
      "name_eus": "Gerrako Lehoiaren Eskumuturrekoak",
      "name_eng": "Bracers of the War Lion",
      "description_eus": "Blokeo bakoitzarekin, erabiltzaileak indarra batzen du, eta honi esker bere hurrengo erasoarentzat boterea handitzen du.",
      "description_eng": "With each block, the wearer accumulates strength and gains power for their next strike.",
      "type_id": 1,
      "special_effect_eus": "Eraso bat blokeatu ondoren, erabiltzailearen hurrengo erasoak +15 kalte jasoko du.",
      "special_effect_eng": "After blocking an attack, the wearer’s next attack gains +15 damage.",
      "durability": 20,
      "prep_time_in_rounds": 1,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 5,
      "name_eus": "Fenix Berpizgarriaren Mantua",
      "name_eng": "Cloak of the Resurgent Phoenix",
      "description_eus": "Mantua honek erabiltzaileari errautsen artetik berpizteko aukera ematen dio kolpe hilgarri bat jaso ondoren.",
      "description_eng": "This cloak allows its wearer to rise from the ashes after taking a lethal blow.",
      "type_id": 2,
      "special_effect_eus": "null",
      "special_effect_eng": "null",
      "durability": 40,
      "prep_time_in_rounds": 4,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 6,
      "name_eus": "Haritz Armarria",
      "name_eng": "Shield of the Ancestral Oak",
      "description_eus": "Mendeetan zehar ekaitzak eta gerrak jasan dituen haritz sakratutik egina, armarri honek kolpe suntsitzaileak xurgatu eta erabiltzailea babesteko gaitasuna du.",
      "description_eng": "Carved from a sacred oak that has withstood centuries of storms and wars, this shield can absorb devastating impacts and protect its wielder from the fiercest attacks.",
      "type_id": 3,
      "special_effect_eus": "Erasoa blokeatzen badu, erasotzaileak 20 kalte jasoko ditu erantzun gisa.",
      "special_effect_eng": "If the wearer blocks an attack, the attacker receives a counterattack dealing 20 damage.",
      "durability": 20,
      "prep_time_in_rounds": 2,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 7,
      "name_eus": "Tabernariaren Mamuaren Koratiloa",
      "name_eng": "Vest of the Spectral Bartender",
      "description_eus": "Behin bizitzaren eta heriotzaren arteko mugan zerbitzatzen zuen tabernari baten jabetzakoa izan zen. Esaten dute hura janzten dutenek une batez desagertzeko gai direla, kolpe hilgarriak saihestuz.",
      "description_eng": "It once belonged to a bartender who served on the border between life and death. It is said that those who wear it can vanish for an instant, avoiding fatal blows.",
      "type_id": 1,
      "special_effect_eus": "Behin bakarrik, erabiltzaileari eraso kritiko bat ezabatzea ahalbidetzen dio.",
      "special_effect_eng": "Once, allows the wearer to ignore a critical attack.",
      "durability": 15,
      "prep_time_in_rounds": 1,
      "image_src": "../images/armor/armor.png"
    },
    {
      "id": 8,
      "name_eus": "Azken Txandaren Kaskoa",
      "name_eng": "Helmet of the Last Round",
      "description_eus": "Borroka aurretik beti edaten zuen gudari baten kaskoa da, eta beti borrokan jarraitzen zuen lur eta ur aurka.",
      "description_eng": "This helm belonged to a warrior who always drank before battle and fought on against all odds.",
      "type_id": 2,
      "special_effect_eus": "null",
      "special_effect_eng": "null",
      "durability": 25,
      "prep_time_in_rounds": 2,
      "image_src": "../images/armor/armor.png"
    }
  ],
  "armor_types": [
    {
      "id": 1,
      "name_eng": "Light",
      "name_eus": "Arina"
    },
    {
      "id": 2,
      "name_eng": "Medium",
      "name_eus": "Ertaina"
    },
    {
      "id": 3,
      "name_eng": "Heavy",
      "name_eus": "Astuna"
    }
  ],
  "weapons": [
    {
      "id": 1,
      "name_eus": "Epai Gorenaren Ezpata",
      "name_eng": "Sword of Supreme Judgment",
      "description_eus": "Zeruko epaiketa-aretoan forjatua, ezpata honek errealitatea bera ebaki dezake. Bere xafla zeruko argiak bezala distiratzen du, eta bere kolpeak absolutuak dira.",
      "description_eng": "Forged in the hall of celestial judgment, this sword can cut through reality itself. Its blade shines with heavenly light, and its strike is absolute.",
      "type_id": 1,
      "damage": 20,
      "durability": 20,
      "prep_time_in_rounds": 2,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 2,
      "name_eus": "Zeruko Piztiaren Atzaparra",
      "name_eng": "Claw of the Celestial Beast",
      "description_eus": "Atzaparra honek altzairua eta magia urratzeko gaitasuna du. Erabiltzean, indarra areagotzen du eta eraso suntsitzaileak egiten uzten dio.",
      "description_eng": "This claw can tear through both steel and magic. When wielded, it enhances the strength of its user and enables devastating attacks.",
      "type_id": 3,
      "damage": 25,
      "durability": 40,
      "prep_time_in_rounds": 3,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 3,
      "name_eus": "Heriotza Isilaren Balezta",
      "name_eng": "Crossbow of Silent Death",
      "description_eus": "Balezta honek zehaztasun hilgarria du eta etsaien bihotza zeharkatzeko gaitasuna du, haiek ohartu baino lehen. Bere diseinua eraso isil eta hilgarrientzat ezin hobea da.",
      "description_eng": "This crossbow possesses deadly accuracy and can fire bolts that pierce through enemies' hearts before they even realize they have been struck. Its design is perfect for silent and lethal attacks.",
      "type_id": 2,
      "damage": 35,
      "durability": 20,
      "prep_time_in_rounds": 3,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 4,
      "name_eus": "Madarikaturiko Koilara",
      "name_eng": "The Cursed Spoon",
      "description_eus": "Madarikatutako koilara honek arimak xurgatzen ditu, indarra handituz. Bere ertzarekin materien esentzia urratu dezake.",
      "description_eng": "This cursed spoon absorbs souls with each strike, boosting strength. Its edge can tear matter's essence apart.",
      "type_id": 1,
      "damage": 10,
      "durability": 15,
      "prep_time_in_rounds": 1,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 5,
      "name_eus": "Betiereko Haserrearen Pitxerra",
      "name_eng": "Jug of Eternal Wrath",
      "description_eus": "Pizti infernalen esentzia dauka barruan. Lurrera botatzen denean, sugar suntsitzaile bihurtzen da. Eztandaren barruan harrapatutakoak su amaiezinean erretzen dira.",
      "description_eng": "It contains the essence of an infernal liquor that, when thrown, explodes into a fiery blaze. Those caught in the flames are engulfed in an inextinguishable fire.",
      "type_id": 2,
      "damage": 20,
      "durability": 10,
      "prep_time_in_rounds": 2,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 6,
      "name_eus": "Etsipenaren Sardexka",
      "name_eng": "Fork of Despair",
      "description_eus": "Arma hori, buruz buruko borroka batean sastakatzeko edo zehaztasun hilgarriz jaurtitzeko erabili daiteke. Kolpatuek ezin deskribatuzko mina sentitzen dute, beraien bekatuak zeharkatzen ariko balitzaizkie bezala.",
      "description_eng": "This weapon can be used to stab in melee combat or be thrown with deadly precision. Those struck feel an indescribable pain, as if their own sins are piercing through them.",
      "type_id": 3,
      "damage": 25,
      "durability": 15,
      "prep_time_in_rounds": 2,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 7,
      "name_eus": "Azken Arnasaren Botila",
      "name_eng": "Bottle of the Last Breath",
      "description_eus": "Kondairak dioenez, botila honek hilzorian zegoen jainko baten azken arnasa gordetzen du. Apurtzean, bizitza xurgatzen duen haize espektro bat askatzen du bere inguruan.",
      "description_eng": "It is said that this bottle contains the final breath of a dying god. When shattered, it releases a spectral wind that drains the life of those in its path.",
      "type_id": 2,
      "damage": 15,
      "durability": 10,
      "prep_time_in_rounds": 1,
      "image_src": "../images/weapons/sword.png"
    },
    {
      "id": 8,
      "name_eus": "Ahaztutako Tabernariaren Labana",
      "name_eng": "Knife of the Forgotten Bartender",
      "description_eus": "Labana hau bizitzaren eta heriotzaren arteko mugan aurkitzen zen tabernariarena izan zen. Mozketa bakoitzarekin, etsaiak bere existentzia desagertzen ari den bezela sentituko du.",
      "description_eng": "This knife belonged to a bartender who served at the boundary between life and death. With each cut, the enemy feels their very existence fading away.",
      "type_id": 1,
      "damage": 45,
      "durability": 1,
      "prep_time_in_rounds": 4,
      "image_src": "../images/weapons/sword.png"
    }
  ],
  "weapon_types": [
    {
      "id": 1,
      "name_eng": "Melee",
      "name_eus": "Borroka Hurbila"
    },
    {
      "id": 2,
      "name_eng": "Missile",
      "name_eus": "Distantzia"
    },
    {
      "id": 3,
      "name_eng": "Hybrid",
      "name_eus": "Hibridoa"
    }
  ],
  "rare": [
    {
      "id": 1,
      "name_eng": "Stolen Fate",
      "name_eus": "Lapurtutako Zoria",
      "description_eng": "Fate changes hands with a simple movement. Who will be the true victor?",
      "description_eus": "Zoria eskuetatik aldatu egiten da mugimendu sinple batekin. Nor izango da benetako garailea?",
      "effect_eng": "Steal two extra cards, but you must discard one from your current hand.",
      "effect_eus": "Bi karta gehigarri lapurtzen dituzu, baina zure esku egungo batean bat baztertu behar duzu.",
      "duration_in_rounds": 0,
      "image_src": "../images/rare/rare.png"
    },
    {
      "id": 2,
      "name_eng": "Hand of the Soul Thief",
      "name_eus": "Arima-Lapurraren Eskua",
      "description_eng": "A dark presence slips into the opponent's mind, stealing their best play.",
      "description_eus": "Presentzia ilun bat etsaiaren buruan sartzen da, haren jokaldirik onena lapurtuz.",
      "effect_eng": "Steal a random card from the enemy and exchange it for one of yours.",
      "effect_eus": "Etsaiari ausazko txartel bat lapurtu eta zureetako batengatik trukatu.",
      "duration_in_rounds": 0,
      "image_src": "../images/rare/rare.png"
    },
    {
      "id": 3,
      "name_eng": "Echo of the Stratagem",
      "name_eus": "Amarruaren Oihartzuna",
      "description_eng": "The voice of the past whispers strategies into the ear of the cleverest.",
      "description_eus": "Iraganeko ahotsak estrategiak xuxurlatzen ditu maltzurrenaren belarrira.",
      "effect_eng": "Steal an enemy's event in preparation, but you'll have to wait two turns to use it.",
      "effect_eus": "Prestakuntzan dagoen etsaiaren ekitaldi bat lapurtzen duzu, baina bi txanda itxaron beharko dituzu hau erabiltzeko.",
      "duration_in_rounds": 0,
      "image_src": "../images/rare/rare.png"
    },
    {
      "id": 4,
      "name_eng": "Shield of Balance",
      "name_eus": "Oreka Eskudoa",
      "description_eng": "An ethereal barrier that protects everyone, but justice is impartial...",
      "description_eus": "Mundu guztia babesten duen hesi etereoa, baina justizia inpartziala da...",
      "effect_eng": "Adds protection for each minion in play.",
      "effect_eus": "Jokoan dauden minion guztientzat babesa gehitzen du.",
      "duration_in_rounds": 2,
      "image_src": "../images/rare/rare.png"
    },
    {
      "id": 5,
      "name_eng": "March of the Last Sigh",
      "name_eus": "Azken Hasperenaren Martxa",
      "description_eng": "When all seems lost, the will to fight shines brighter than ever.",
      "description_eus": "Denak galdura dirudienean, borrokarako borondateak inoiz baino distira handiagoa du.",
      "effect_eng": "If your HP is below 50%, all your minions gain +4 attack.",
      "effect_eus": "Zure HP %50 baino gutxiago baldin bada, zure minion guztiek +4 eraso irabazten dute.",
      "duration_in_rounds": 3,
      "image_src": "../images/rare/rare.png"
    },
    {
      "id": 6,
      "name_eng": "The Cup of the Last Breath",
      "name_eus": "Azken Hatsaren Kopa",
      "description_eng": "Forged in oblivion, this chalice traps foes in eternal agony, erasing all hope.",
      "description_eus": "Ahanztean forjatua, kopa honek etsaiak betiko agonian harrapatzen ditu, itxaropena ezabatuz.",
      "effect_eng": "The opponent and their minions cannot self-heal at the end of their turn.",
      "effect_eus": "Aurkariak eta bere minionek ezin dute beren burua sendatu txandaren amaieran.",
      "duration_in_rounds": 2,
      "image_src": "../images/rare/rare.png"
    }
  ],
  "special": [
    {
      "id": 1,
      "name_eng": "Hand of God",
      "name_eus": "Jainkoaren Eskua",
      "description_eng": "A hand in the heavens, raised in the direction of the firmament as if proclaiming his divine judgment. Its very presence imposes awe and reverence, illuminating the battlefield with a blinding light.",
      "description_eus": "Zeruan dagoen eskua, haren epaiketa bidegabea iragartzen duen moduan altxatua. Bere presentziak errespetua eta harritasuna ezartzen ditu, eta borroka zelaiaren gainean argi itsaskor batez distira egiten du.",
      "effect_eng": "Summon main character.",
      "effect_eus": "Pertsonaia nagusia deitu.",
      "duration_in_rounds": 3,
      "prep_time_in_rounds": 0,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 2,
      "name_eng": "Judgment of the Ancients",
      "name_eus": "Antzinakoen Epaiaren Judizioa",
      "description_eng": "An unappealable verdict dictated by ancestral entities that punishes the arrogance of mortals.",
      "description_eus": "Aita-amen entitateek emandako epai ezin errebatigarria, heriotza eskatzen duen epai bat.",
      "effect_eng": "The enemy cannot attack in the next round.",
      "effect_eus": "Aste honetan ez du inongo eraso egiteko aukera izango.",
      "duration_in_rounds": 0,
      "prep_time_in_rounds": 1,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 3,
      "name_eng": "Ray of Celestial Ruin",
      "name_eus": "Zeruaren Suntsiketa Izpi",
      "description_eng": "A divine lightning bolt falling from the sky, destroying everything in its path.",
      "description_eus": "Zerutik jaisten den izpi zoragarria, bere bidean guztia suntsitzen duena.",
      "effect_eng": "If the enemy has armor, it ignores half of their resistance.",
      "effect_eus": "Amezuloen armaduran, erresistentziaren erdiari uko egiten du.",
      "duration_in_rounds": 0,
      "prep_time_in_rounds": 0,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 4,
      "name_eng": "Poison of the Abyss",
      "name_eus": "Amildegiaren Pozoia",
      "description_eng": "A dark poison that slowly corrodes the enemy’s life, with no possibility of being healed.",
      "description_eus": "Pozoia iluna, etsaiaren bizitza pixkanaka jaten duena, sendatze aukera gabe.",
      "effect_eng": "The enemy loses 5 health points per turn until the duration ends. Cannot be healed during this effect.",
      "effect_eus": "Etsaiak 5 osasun puntu galtzen ditu txanda bakoitzean iraupena bukatu bitartean. Efektu hau bitartean ezin da sendatu.",
      "duration_in_rounds": 3,
      "prep_time_in_rounds": 2,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 5,
      "name_eng": "Curse of the Bound Titan",
      "name_eus": "Titanoen Maledizioa",
      "description_eng": "A dark chain clutches the enemy’s soul, weakening them and reducing their strength in battle.",
      "description_eus": "Pozoia iluna, etsaiaren izpirituaren giltzapean jartzen duen katea, leku batean ahuldu eta ahuldu egiten dituena.",
      "effect_eng": "During the duration, the enemy deals 10 less damage in their attacks.",
      "effect_eus": "Iraupen honetan, etsaiak 3 kalte gutxiago egiten du bere erasotan.",
      "duration_in_rounds": 3,
      "prep_time_in_rounds": 1,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 6,
      "name_eng": "The Bartender’s Power",
      "name_eus": "Tabernariaren Indarra",
      "description_eng": "The tavern bartender grants strength and protection with his magical cup, revitalizing allies.",
      "description_eus": "Tabernariak bere edalontzi magikoarekin indarra eta babesa emanten du, eta aliatuak biziberritzen ditu.",
      "effect_eng": "Increases attack and defense by 7 points for all minions.",
      "effect_eus": "Eraso eta defentsa puntu 7 puntu handitzen ditu minio guztientzat.",
      "duration_in_rounds": 2,
      "prep_time_in_rounds": 2,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 7,
      "name_eng": "The Broom’s Fury",
      "name_eus": "Erratzaren Haserrea",
      "description_eng": "This enchanted broom sweeps away all obstacles and grants immense swiftness and power to the user. It is said to be the broom of a legendary janitor who cleansed entire battlefields.",
      "description_eus": "Erratz magiko honek oztopo guztiak garbitzen ditu eta erabiltzaileari izugarrizko azkartasun eta indarra ematen dio. Esaten da borroka zelaietan askotan garbitzaile mitikoa izan dela.",
      "effect_eng": "Doubles the user's attack power for the duration of the effect.",
      "effect_eus": "Erabiltzailearen eraso indarra bikoizten du efektuaren iraupenean.",
      "duration_in_rounds": 2,
      "prep_time_in_rounds": 1,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 8,
      "name_eng": "Blessing of the Waitress",
      "name_eus": "Zerbitzariaren Bedeinkapena",
      "description_eng": "With a touch of her tray, the barmaid's blessing heals and invigorates the wounded. Her drinks bring more than joy; they replenish the spirits of those who drink them.",
      "description_eus": "Bere erretiluaren ukitu batekin, tabernariaren bedeinkapenak sendatzen eta indartzen ditu zaurituak. Bere edariak ez dira soilik pozak, baizik eta edaten dituztenen espirituak berritzen dituzte.",
      "effect_eng": "Restores 30 health to an ally.",
      "effect_eus": "Aliatu bati 10 osasun berreskuratzen dizkio",
      "duration_in_rounds": 0,
      "prep_time_in_rounds": 2,
      "image_src": "../images/special/special.png"
    },
    {
      "id": 9,
      "name_eng": "Potion of the Eternal Night",
      "name_eus": "Betiko Gaueko Edabea",
      "description_eng": "Forged in the dark laboratories of forgotten alchemists, this potion breaks the chains of the curse and restores the stolen essence… but its bitterness leaves a lethal mark on its caster.",
      "description_eus": "Ahaztutako alkimisten laborategi ilunetan sortutako edabe honek madarikazioaren kateak apurtu eta lapurtutako esentzia berreskuratzen du, baina bere mingostasunak arrasto hilgarria uzten du bere erabiltzailean.",
      "effect_eng": "Removes Lucretia's curse and reverses the transformation into a deer. In addition, it poisons inflicting a damage of 5 HP per round.",
      "effect_eus": "Lucretia-ren madarikazioa ezabatzen du eta orein bihurtzeko prozesua leheneratzen du. Gainera, erabiltzailearen minion-ak txanda bakoitzean 5 kolpe-puntuko kaltea eraginez pozoitzen ditu.",
      "duration_in_rounds": 2,
      "prep_time_in_rounds": 2,
      "image_src": "../images/special/special.png"
    }
  ]
}
